using System;   // Подключение пространств имён (библиотек)

namespace Basics    // Создание своего пространства имён (библиотеки)
{
    class Program   // Главный класс в консольном приложении
    {
        static void Main(string[] args) // Главный метод, с которого запускается программа
        {
            Console.WriteLine("Hello, World!"); // Выводит на консоль фразу "Hello World!"
            Console.ReadLine();                 // Задержка закрытия, чтобы пользователь смог увидеть результат
        }
    }
}
